{"body": [{"body": [{"body": [{"indent": 4, "type": "para", "extent": [62, 905], "text": ["This determines how strongly the solid object resists deformation. For small deformation this corresponds to Young’s modulus in units of Pascal (kg per meter per squared second). This is independent of the resolution of the mesh and the shapes of the elements in the mesh. The defaults settings for the ", {"text": ["Overall Stiffness"], "type": "ui"}, " works the best if you model the simulation geometry to real size. If you don’t model your geometry in meters, then make sure that you set the correct units of length in the Hip File Options. This should be done ", {"text": ["before"], "type": "strong"}, " you create your DOP network. When using real-size models, you should make sure that you have your length units set correctly before you create your DOP network: You should set the correct ", {"text": ["Unit Length"], "type": "ui"}, " in ", {"text": ["Edit"], "type": "ui"}, " > ", {"text": ["Preferences"], "type": "ui"}, " > ", {"text": ["Hip File Options"], "type": "ui"}, " before you create your DOP network."]}], "indent": 0, "text": ["Overall Stiffness"], "attrs": {"id": "overallstiffness"}, "extent": [16, 35], "container": true, "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [943, 1475], "text": ["This value should lie between 0 and 1. It controls the rate of energy loss as a result of the rate of deformation. A value of 0 means that there is no loss of energy due to internal damping forces. A value of 1 means that the object is critically damped, in which case the object comes to rest in the quickest possible way without oscillating. The higher the damping ratio, the less the solid oscillates and the quicker the object’s motion will come to rest. The effect of damping is independent of your geometry’s resolution."]}], "indent": 0, "text": ["Damping Ratio"], "attrs": {"id": "dampingratio"}, "extent": [905, 920], "container": true, "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [1524, 1883], "text": ["This is the mass per cubed length unit. The mass density can be made lower or higher in parts of the object using the primitive attribute ", {"text": ["volumemassdensity"], "type": "code"}, ", which works as a multiplier for the parameter. The higher the mass density, the less the object tends to accelerate as a result of any internal or external forces (F = m a, Newton’s second law)."]}], "indent": 0, "text": ["Volume Mass Density"], "attrs": {"id": "volumemassdensity"}, "extent": [1475, 1496], "container": true, "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [1931, 2158], "text": ["This number, between 0 and 1, controls how much the object resists stretching and compression in any direction. This controls the shape-preserving contribution of the internal forces relative to the ", {"text": ["Overall Stiffness"], "type": "ui"}, "."]}], "indent": 0, "text": ["Shape Preservation"], "attrs": {"id": "shapepreservation"}, "extent": [1883, 1903], "container": true, "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [2208, 2411], "text": ["This number, between 0 and 1, controls how strong the object tries to preserve volume. This controls the volume-preserving contribution of the internal forces relative to the ", {"text": ["Overall Stiffness"], "type": "ui"}, "."]}], "indent": 0, "text": ["Volume Preservation"], "attrs": {"id": "volumepreservation"}, "extent": [2158, 2179], "container": true, "type": "dt"}, {"body": [{"indent": 4, "type": "para", "extent": [2453, 3223], "text": ["These values allow you to make the internal forces of the Solid Object behave in an anisotropic way; in that case, the amount of stress will differ depending on the direction in which the object is deformed. An example of an anisotropic material is wood, which has a different strength along the grain than perpendicular to the grain. The ", {"text": ["materialuvw"], "type": "code"}, " vertex or point attribute can be used to specify the internal directions of the Solid Object’s internal force model. For example, in the case of wood, the U direction could be aligned with the grain of the wood, while the VW coordinates are chosen perpendicular to the grain of the wood. In this case, the strength along the grain can be separately controlled using the U component of the ", {"text": ["Anisotropic Strength"], "type": "code"}, "."]}], "indent": 0, "text": ["Anisotropic Strength"], "attrs": {"id": "aniso"}, "extent": [2411, 2433], "container": true, "type": "dt"}], "container": true, "type": "dt_group"}], "type": "root", "attrs": {"type": "include"}}